In [144]:
import pandas as pd

# Series

In [145]:
data = [1,2,3,4,5]
data

[1, 2, 3, 4, 5]

In [146]:
s = pd.Series(data)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [147]:
index = ['Linha' + str(i) for i in range(5)]
index

['Linha0', 'Linha1', 'Linha2', 'Linha3', 'Linha4']

In [148]:
s = pd.Series(data = data, index = index)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

In [149]:
data = {'Linha' +  str(i): i + 1 for i in range(5)}
data

{'Linha0': 1, 'Linha1': 2, 'Linha2': 3, 'Linha3': 4, 'Linha4': 5}

In [150]:
s = pd.Series(data)
s

Linha0    1
Linha1    2
Linha2    3
Linha3    4
Linha4    5
dtype: int64

# DataFrame

In [151]:
data = [[1,2,3], 
        [4,5,6], 
        [7,8,9]]

In [152]:
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [153]:
df1 = pd.DataFrame(data = data)

In [154]:
df1

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [155]:
index = ['Linha' + str(i) for i in range(3)]

In [156]:
index

['Linha0', 'Linha1', 'Linha2']

In [157]:
df1 = pd.DataFrame(data = data, index = index)
df1

        0  1  2
Linha0  1  2  3
Linha1  4  5  6
Linha2  7  8  9

In [158]:
columns = ['Coluna'+ str(i) for i in range(3)]
columns

['Coluna0', 'Coluna1', 'Coluna2']

In [159]:
df1 = pd.DataFrame(data = data, index = index, columns = columns)
df1

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [160]:
df3 = pd.DataFrame(data = data, index = index, columns = columns)
df3

        Coluna0  Coluna1  Coluna2
Linha0        1        2        3
Linha1        4        5        6
Linha2        7        8        9

In [161]:
df3[df3 > 0] = 'A'
df3

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A

In [162]:
df1[df1 > 0] = 'B'
df1

       Coluna0 Coluna1 Coluna2
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [163]:
df4 = pd.concat([df3, df1])
df4

       Coluna0 Coluna1 Coluna2
Linha0       A       A       A
Linha1       A       A       A
Linha2       A       A       A
Linha0       B       B       B
Linha1       B       B       B
Linha2       B       B       B

In [164]:
df4 = pd.concat([df3, df1], axis = 1)
df4

       Coluna0 Coluna1 Coluna2 Coluna0 Coluna1 Coluna2
Linha0       A       A       A       B       B       B
Linha1       A       A       A       B       B       B
Linha2       A       A       A       B       B       B

In [167]:
dados = [[1,2,3], [4,5,6]]
index = 'X,Y'.split(',')
columns = list('CBA')[::-1]
df = pd.DataFrame(dados, index, columns)
df

   A  B  C
X  1  2  3
Y  4  5  6

In [169]:
dados = {'A': {'X': 1, 'Y': 3}, 'B': {'X': 2, 'Y': 4}}
df = pd.DataFrame(dados)
df

   A  B
X  1  2
Y  3  4